In [4]:
import numpy as np
import pandas as pd

# Statistics / Data Analysis

In [29]:
# simplest case is to create df from a dict[string:array] where the string 
# gives the column name and the array holds the corresponding values
# the index implicitely starts at 0
d = {"one": [1.0, 2.0, 3.0, 4.0, 2.0], "two": [1.0, -4.6, 3.0, 7.0, -1.4]}
df = pd.DataFrame(d)
df

   one  two
0  1.0  1.0
1  2.0 -4.6
2  3.0  3.0
3  4.0  7.0
4  2.0 -1.4

In [31]:
df.describe()

            one     two
count  5.000000  5.0000
mean   2.400000  1.0000
std    1.140175  4.3909
min    1.000000 -4.6000
25%    2.000000 -1.4000
50%    2.000000  1.0000
75%    3.000000  3.0000
max    4.000000  7.0000

In [33]:
df.mean()

one    2.4
two    1.0
dtype: float64

In [35]:
df.mean(1)

0    1.0
1   -1.3
2    3.0
3    5.5
4    0.3
dtype: float64

In [37]:
df.apply(lambda x: np.cumsum(x))

    one  two
0   1.0  1.0
1   3.0 -3.6
2   6.0 -0.6
3  10.0  6.4
4  12.0  5.0

In [39]:
df.one.value_counts()

one
2.0    2
1.0    1
3.0    1
4.0    1
Name: count, dtype: int64

# Calcluate new Columns

In [44]:
df["three"] = df["one"]**2
df

   one  two  three
0  1.0  1.0    1.0
1  2.0 -4.6    4.0
2  3.0  3.0    9.0
3  4.0  7.0   16.0
4  2.0 -1.4    4.0